Repository: KiYouJyo/UCAD
Catalog: src/UCAD.App/Strings/*/ShellLive.resw
Source language: en_us
Languages: ja_jp, zh_cn

source: File
ja_jp: ファイル
zh_cn: 文件

source: Edit
ja_jp: 編集
zh_cn: 编辑

source: View
ja_jp: 表示
zh_cn: 视图

source: New drawing
ja_jp: 新しい図面
zh_cn: 新建图纸

# CloseDrawing
source: Close current drawing
ja_jp: 現在の図面を閉じる
zh_cn: 关闭当前图纸

source: Undo
ja_jp: 元に戻す
zh_cn: 撤销

source: Redo
ja_jp: やり直し
zh_cn: 重做

# Clear
source: Clear drawing
ja_jp: 図面を全消去
zh_cn: 清空图形

source: Reset view
ja_jp: ビューをリセット
zh_cn: 重置视图

# CategoryDraw
source: Draw
ja_jp: 作図
zh_cn: 绘图

# CategoryModify
source: Modify
ja_jp: 修正
zh_cn: 修改

# CategoryAnnotate
source: Annotate
ja_jp: 注釈
zh_cn: 注释

# CategoryLayers
source: Layers
ja_jp: レイヤー
zh_cn: 图层

# CategoryBlocks
source: Blocks
ja_jp: ブロック
zh_cn: 图块

# CategoryMeasure
source: Measure
ja_jp: 計測
zh_cn: 测量

# CategoryView
source: View
ja_jp: 表示
zh_cn: 视图

# CommandSearchPlaceholder
source: Search commands
ja_jp: コマンドを検索
zh_cn: 搜索命令

# ToolLine
source: Line
ja_jp: 線分
zh_cn: 直线

# ToolPolyline
source: Polyline
ja_jp: ポリライン
zh_cn: 多段线

# ToolRectangle
source: Rectangle
ja_jp: 長方形
zh_cn: 矩形

# ToolCircle
source: Circle
ja_jp: 円
zh_cn: 圆

# ToolArc
source: Arc
ja_jp: 円弧
zh_cn: 圆弧

# ToolHatch
source: Hatch
ja_jp: ハッチ
zh_cn: 填充

# ToolBoundary
source: Boundary
ja_jp: 境界
zh_cn: 边界

# ToolRay
source: Ray
ja_jp: 放射線
zh_cn: 射线

# ToolConstruction
source: XLine
ja_jp: 構築線
zh_cn: 构造线

# InspectorProperties
source: Properties
ja_jp: プロパティ
zh_cn: 属性

# InspectorLayers
source: Layers
ja_jp: レイヤー
zh_cn: 图层

# InspectorNoSelection
source: No selection
ja_jp: 選択なし
zh_cn: 未选择对象

# InspectorSelectionUnavailable
source: Selection arrives in v0.4.0; this panel currently exposes active-document state.
ja_jp: 選択機能は v0.4.0 で接続します。現在はアクティブ図面の状態を表示します。
zh_cn: 选择功能将在 v0.4.0 接入；当前面板先显示活动文档状态。

# InspectorDocument
source: DOCUMENT
ja_jp: 図面
zh_cn: 文档

# InspectorEntityCount
source: Entities
ja_jp: エンティティ数
zh_cn: 实体数

# InspectorActiveCommand
source: Active command
ja_jp: 実行中コマンド
zh_cn: 活动命令

# InspectorUndoAvailable
source: Undo available
ja_jp: 元に戻せる
zh_cn: 可撤销

# InspectorRedoAvailable
source: Redo available
ja_jp: やり直せる
zh_cn: 可重做

# InspectorFoundationHint
source: The workspace and HiDPI foundation is in place; v0.4.0 will add selection, snapping, and ortho on the existing CadWorkspaceSession boundary.
ja_jp: HiDPI とワークスペースの視覚基盤は整備済みです。v0.4.0 では既存の CadWorkspaceSession 境界に選択・スナップ・直交を接続します。
zh_cn: 高 DPI 与工作区视觉基础已经就绪；v0.4.0 将在现有 CadWorkspaceSession 边界上接入选择、捕捉与正交。

# InspectorSelectionHelp
source: Click an entity to select it, or drag a selection window.
ja_jp: オブジェクトをクリックして選択するか、ドラッグして選択窓を作成します。
zh_cn: 单击对象进行选择，或拖动鼠标进行框选。

# InspectorSelectionWindowHint
source: Left-to-right selects enclosed objects; right-to-left selects crossing objects. Esc clears selection. F3 toggles OSNAP; F8 toggles ORTHO.
ja_jp: 左から右は完全に含まれるオブジェクトを選択し、右から左は交差するオブジェクトも選択します。Esc で選択解除、F3 で OSNAP、F8 で直交を切り替えます。
zh_cn: 从左向右为窗口选择（完全包含），从右向左为交叉选择（相交即选）；Esc 清除选择。F3 切换对象捕捉，F8 切换正交。

# InspectorMultipleSelectionFormat
source: {0} objects selected
ja_jp: {0} 個のオブジェクトを選択中
zh_cn: 已选择 {0} 个对象

# InspectorMixedSelection
source: Multiple entity types are selected.
ja_jp: 複数種類のエンティティが選択されています。
zh_cn: 当前选择包含多种实体类型。

# InspectorSelection
source: SELECTION
ja_jp: 選択
zh_cn: 选择

# InspectorSelectedCount
source: Selected
ja_jp: 選択数
zh_cn: 已选择

# InspectorEntityType
source: Type
ja_jp: 種類
zh_cn: 类型

# InspectorMixed
source: Mixed
ja_jp: 混在
zh_cn: 混合

# InspectorGeometry
source: Geometry
ja_jp: ジオメトリ
zh_cn: 几何

# InspectorEntityId
source: Entity ID
ja_jp: エンティティ ID
zh_cn: 实体 ID

# EntityLine
source: Line
ja_jp: 線分
zh_cn: 直线

# EntityPolyline
source: Polyline
ja_jp: ポリライン
zh_cn: 多段线

# EntityCircle
source: Circle
ja_jp: 円
zh_cn: 圆

# EntityArc
source: Arc
ja_jp: 円弧
zh_cn: 圆弧

# GeometryLineFormat
source: Length {0:0.##}
ja_jp: 長さ {0:0.##}
zh_cn: 长度 {0:0.##}

# GeometryPolylineFormat
source: Vertices {0}, length {1:0.##}
ja_jp: 頂点 {0}、長さ {1:0.##}
zh_cn: 顶点 {0}，长度 {1:0.##}

# GeometryCircleFormat
source: Radius {0:0.##}
ja_jp: 半径 {0:0.##}
zh_cn: 半径 {0:0.##}

# GeometryArcFormat
source: Radius {0:0.##}, sweep {1:0.##}°
ja_jp: 半径 {0:0.##}、中心角 {1:0.##}°
zh_cn: 半径 {0:0.##}，圆心角 {1:0.##}°

# CommandPrompt
source: Command:
ja_jp: コマンド:
zh_cn: 命令:

# CommandInputPlaceholder
source: Enter command, coordinate, or distance
ja_jp: コマンド、座標、距離を入力
zh_cn: 输入命令、坐标或距离

# StatusSnap
source: SNAP
ja_jp: スナップ
zh_cn: 捕捉

# StatusGrid
source: GRID
ja_jp: グリッド
zh_cn: 栅格

# StatusOrtho
source: ORTHO
ja_jp: 直交
zh_cn: 正交

# StatusPolar
source: POLAR
ja_jp: 極軸
zh_cn: 极轴

# StatusOsnap
source: OSNAP
zh_cn: 对象捕捉

# StatusOtrack
source: OTRACK
zh_cn: 对象追踪

# StatusOsnapOnMessage
source: Object snap on (F3)
ja_jp: オブジェクトスナップをオン（F3）
zh_cn: 对象捕捉已开启（F3）

# StatusOsnapOffMessage
source: Object snap off (F3)
ja_jp: オブジェクトスナップをオフ（F3）
zh_cn: 对象捕捉已关闭（F3）

# StatusOrthoOnMessage
source: Ortho mode on (F8)
ja_jp: 直交モードをオン（F8）
zh_cn: 正交模式已开启（F8）

# StatusOrthoOffMessage
source: Ortho mode off (F8)
ja_jp: 直交モードをオフ（F8）
zh_cn: 正交模式已关闭（F8）

# ModifySelectObjects
source: Select objects, then press Enter.
ja_jp: オブジェクトを選択し、Enter で確定してください。
zh_cn: 选择对象，然后按 Enter 确认。

# ModifyBasePoint
source: Specify base point.
ja_jp: 基点を指定してください。
zh_cn: 指定基点。

# ModifyPointRequired
source: Specify a valid point.
ja_jp: 有効な点を指定してください。
zh_cn: 请指定有效点。

# ModifyMoveTarget
source: Specify second point or displacement.
ja_jp: 2 点目または移動量を指定してください。
zh_cn: 指定第二点或位移。

# ModifyCopyTarget
source: Specify second point for the copy.
ja_jp: 複写先の 2 点目を指定してください。
zh_cn: 指定复制的第二点。

# ModifyRotationAngle
source: Specify rotation angle in degrees or pick a point.
ja_jp: 回転角度（度）を入力するか、点を指定してください。
zh_cn: 输入旋转角度（度）或在画布上指定点。

# ModifyScaleFactor
source: Specify a positive scale factor or pick a point.
ja_jp: 正の尺度係数を入力するか、点を指定してください。
zh_cn: 输入正数比例因子或在画布上指定点。

# ModifyMirrorFirstPoint
source: Specify first point of mirror line.
ja_jp: 鏡像軸の 1 点目を指定してください。
zh_cn: 指定镜像轴的第一点。

# ModifyMirrorSecondPoint
source: Specify second point of mirror line.
ja_jp: 鏡像軸の 2 点目を指定してください。
zh_cn: 指定镜像轴的第二点。

# ModifyMirrorEraseSource
source: Erase source objects? [Yes/No] <No>:
ja_jp: 元のオブジェクトを削除しますか？ [はい/いいえ] <いいえ>:
zh_cn: 删除源对象？[是/否] <否>：

# ModifyOffsetDistance
source: Specify offset distance.
ja_jp: オフセット距離を指定してください。
zh_cn: 指定偏移距离。

# ModifyOffsetPickEntity
source: Select object to offset.
ja_jp: オフセットするオブジェクトを選択してください。
zh_cn: 选择要偏移的对象。

# ModifyOffsetSidePoint
source: Specify point on side to offset.
ja_jp: オフセットする側の点を指定してください。
zh_cn: 在要偏移的一侧指定点。

# ModifyTrimPick
source: Select object segment to trim; press Enter to finish.
ja_jp: トリムする部分を選択してください。Enter で終了します。
zh_cn: 选择要修剪的对象段；按 Enter 结束。

# ModifyExtendPick
source: Select object end to extend; press Enter to finish.
ja_jp: 延長する端を選択してください。Enter で終了します。
zh_cn: 选择要延伸的对象端；按 Enter 结束。

# ModifyComplete
source: Modify command completed.
ja_jp: 修正コマンドが完了しました。
zh_cn: 修改命令已完成。

# ModifyTrimContinue
source: Trimmed. Select another segment or press Enter to finish.
ja_jp: トリムしました。続けて部分を選択するか、Enter で終了します。
zh_cn: 已修剪。继续选择对象段，或按 Enter 结束。

# ModifyTrimNoBoundary
source: No valid trimming boundary found at that pick.
ja_jp: その位置に有効なトリム境界がありません。
zh_cn: 该位置未找到有效修剪边界。

# ModifyExtendContinue
source: Extended. Select another end or press Enter to finish.
ja_jp: 延長しました。続けて端を選択するか、Enter で終了します。
zh_cn: 已延伸。继续选择对象端，或按 Enter 结束。

# ModifyExtendNoBoundary
source: No valid extension boundary found in that direction.
ja_jp: その方向に有効な延長境界がありません。
zh_cn: 该方向未找到有效延伸边界。

# ModifyMoveComplete
source: Move completed.
ja_jp: 移動が完了しました。
zh_cn: 移动完成。

# ModifyCopyComplete
source: Copy completed.
ja_jp: 複写が完了しました。
zh_cn: 复制完成。

# ModifyRotateComplete
source: Rotate completed.
ja_jp: 回転が完了しました。
zh_cn: 旋转完成。

# ModifyScaleComplete
source: Scale completed.
ja_jp: 尺度変更が完了しました。
zh_cn: 缩放完成。

# ModifyMirrorComplete
source: Mirror completed.
ja_jp: 鏡像が完了しました。
zh_cn: 镜像完成。

# ModifyOffsetInvalid
source: Offset could not be created on that side.
ja_jp: その側に有効なオフセットを作成できません。
zh_cn: 无法在该侧创建有效偏移。

# ModifyOffsetComplete
source: Offset completed.
ja_jp: オフセットが完了しました。
zh_cn: 偏移完成。

# CommandLabel_LINE
source: Line
ja_jp: 線分
zh_cn: 直线

# CommandLabel_PLINE
source: Polyline
ja_jp: ポリライン
zh_cn: 多段线

# CommandLabel_RECTANGLE
source: Rectangle
ja_jp: 長方形
zh_cn: 矩形

# CommandLabel_CIRCLE
source: Circle
ja_jp: 円
zh_cn: 圆

# CommandLabel_ARC
source: Arc
ja_jp: 円弧
zh_cn: 圆弧

# CommandLabel_HATCH
source: Hatch
ja_jp: ハッチ
zh_cn: 填充

# CommandLabel_HATCHADV
source: Advanced hatch
ja_jp: 高度なハッチ
zh_cn: 高级填充

# CommandLabel_HATCHEDIT
source: Edit hatch
ja_jp: ハッチ編集
zh_cn: 编辑填充

# CommandLabel_BOUNDARY
source: Boundary
ja_jp: 境界
zh_cn: 边界

# CommandLabel_RAY
source: Ray
ja_jp: 放射線
zh_cn: 射线

# CommandLabel_XLINE
source: XLine
ja_jp: 構築線
zh_cn: 构造线

# CommandLabel_ELLIPSE
source: Ellipse
ja_jp: 楕円
zh_cn: 椭圆

# CommandLabel_POLYGON
source: Polygon
ja_jp: ポリゴン
zh_cn: 多边形

# CommandLabel_SPLINE
source: Spline
ja_jp: スプライン
zh_cn: 样条曲线

# CommandLabel_POINT
source: Point
ja_jp: 点
zh_cn: 点

# CommandLabel_MOVE
source: Move
ja_jp: 移動
zh_cn: 移动

# CommandLabel_COPY
source: Copy
ja_jp: 複写
zh_cn: 复制

# CommandLabel_ERASE
source: Erase
ja_jp: 削除
zh_cn: 删除

# CommandLabel_OFFSET
source: Offset
ja_jp: オフセット
zh_cn: 偏移

# CommandLabel_TRIM
source: Trim
ja_jp: トリム
zh_cn: 修剪

# CommandLabel_ROTATE
source: Rotate
ja_jp: 回転
zh_cn: 旋转

# CommandLabel_SCALE
source: Scale
ja_jp: 尺度変更
zh_cn: 缩放

# CommandLabel_MIRROR
source: Mirror
ja_jp: 鏡像
zh_cn: 镜像

# CommandLabel_EXTEND
source: Extend
ja_jp: 延長
zh_cn: 延伸

# CommandLabel_EXPLODE
source: Explode
ja_jp: 分解
zh_cn: 分解

# CommandLabel_STRETCH
source: Stretch
ja_jp: ストレッチ
zh_cn: 拉伸

# CommandLabel_FILLET
source: Fillet
ja_jp: フィレット
zh_cn: 圆角

# CommandLabel_CHAMFER
source: Chamfer
ja_jp: 面取り
zh_cn: 倒角

# CommandLabel_ARRAY
source: Array
ja_jp: 配列
zh_cn: 阵列

# CommandLabel_BREAK
source: Break
ja_jp: ブレーク
zh_cn: 打断

# CommandLabel_JOIN
source: Join
ja_jp: 結合
zh_cn: 合并

# CommandLabel_PEDIT
source: Polyline edit
ja_jp: ポリライン編集
zh_cn: 多段线编辑

# CommandLabel_TEXT
source: Text
ja_jp: 文字
zh_cn: 单行文字

# CommandLabel_MTEXT
source: MText
ja_jp: マルチテキスト
zh_cn: 多行文字

# CommandLabel_DIM
source: Linear dimension
ja_jp: 長さ寸法
zh_cn: 线性标注

# CommandLabel_DIMALIGNED
source: Aligned dimension
ja_jp: 平行寸法
zh_cn: 对齐标注

# CommandLabel_DIMANGULAR
source: Angular dimension
ja_jp: 角度寸法
zh_cn: 角度标注

# CommandLabel_DIMRADIUS
source: Radius dimension
ja_jp: 半径寸法
zh_cn: 半径标注

# CommandLabel_DIMDIAMETER
source: Diameter dimension
ja_jp: 直径寸法
zh_cn: 直径标注

# CommandLabel_LEADER
source: Leader
ja_jp: 引出線
zh_cn: 引线

# CommandLabel_TEXTSTYLE
source: Text style
ja_jp: 文字スタイル
zh_cn: 文字样式

# CommandLabel_DIMSTYLE
source: Dimension style
ja_jp: 寸法スタイル
zh_cn: 标注样式

# CommandLabel_LAYER
source: Layer
ja_jp: レイヤー
zh_cn: 图层

# CommandLabel_CHPROP
source: Properties
ja_jp: オブジェクトプロパティ
zh_cn: 对象属性

# CommandLabel_BLOCK
source: Create block
ja_jp: ブロック作成
zh_cn: 创建图块

# CommandLabel_INSERT
source: Insert block
ja_jp: ブロック挿入
zh_cn: 插入图块

# CommandLabel_BLOCKMANAGER
source: Block manager
ja_jp: ブロック管理
zh_cn: 图块管理

# CommandLabel_ATTDEF
source: Attribute definition
ja_jp: 属性定義
zh_cn: 定义属性

# CommandLabel_ATTEDIT
source: Edit attributes
ja_jp: 属性編集
zh_cn: 编辑属性

# CommandLabel_BLOCKREDEFINE
source: Redefine block
ja_jp: ブロック再定義
zh_cn: 重定义图块

# CommandLabel_XREF
source: Xref
ja_jp: 外部参照
zh_cn: 外部参照

# CommandLabel_PAGESETUP
source: Page setup
ja_jp: ページ設定
zh_cn: 页面设置

# CommandLabel_LAYOUT
source: Layout
ja_jp: レイアウト
zh_cn: 布局

# CommandLabel_VIEWPORT
source: Viewport
ja_jp: ビューポート
zh_cn: 视口

# CommandLabel_VIEWPORTS
source: Viewports
ja_jp: ビューポート管理
zh_cn: 视口管理

# CommandLabel_PREVIEW
source: Plot preview
ja_jp: 印刷プレビュー
zh_cn: 打印预览

# CommandLabel_PLOT
source: Plot
ja_jp: 印刷
zh_cn: 打印

# CommandLabel_PDF
source: Export PDF
ja_jp: PDF 書き出し
zh_cn: 导出 PDF

# CommandLabel_PRINT
source: System print
ja_jp: システム印刷
zh_cn: 系统打印

# CommandLabel_RESETVIEW
source: Reset view
ja_jp: ビューをリセット
zh_cn: 重置视图
